const HOT_CITIES = [
    '上海', '北京', '成都', '重庆', '杭州', '广州', '深圳', '西安', '长沙', '南京',
    '三亚', '厦门', '青岛', '昆明', '武汉', '苏州', '天津', '郑州', '哈尔滨', '大连',
    '沈阳', '济南', '福州', '南宁', '贵阳', '海口', '乌鲁木齐', '兰州', '西宁', '银川',
    '呼和浩特', '拉萨', '太原', '石家庄', '合肥', '南昌', '长春', '桂林', '张家界', '黄山',
    '大理', '丽江', '西双版纳', '敦煌', '九寨沟', '峨眉山', '洛阳', '开封', '大同', '承德',
    '秦皇岛', '烟台', '威海', '蓬莱', '舟山', '宁波', '绍兴', '扬州', '无锡', '徐州',
    '温州', '泉州', '潮州', '汕头', '珠海', '佛山', '惠州', '北海', '湛江', '万宁',
    '呼伦贝尔', '满洲里', '长白山', '泰安', '平遥', '恩施', '神农架', '婺源', '景德镇', '阳朔',
    '腾冲', '香格里拉', '张掖', '嘉峪关', '吐鲁番', '喀什', '伊犁', '阿勒泰'
]

export const CITY_COLUMNS = HOT_CITIES.map((name) => ({ text: name, value: name }))
